### [ crawler example: appledaily ]

In [4]:
import requests
from bs4 import BeautifulSoup

In [2]:
res = requests.get('https://tw.appledaily.com/new/realtime/1')

In [5]:
soup = BeautifulSoup(res.text,'lxml')

In [12]:
urls =list()
for i in soup.select('.rtddt a'):
#     print(i.get('href'))
    url = i['href']
    print(url)
    urls.append(url)

https://tw.news.appledaily.com/life/realtime/20180802/1403016/
https://tw.finance.appledaily.com/realtime/20180802/1402765/
https://tw.news.appledaily.com/local/realtime/20180802/1402454/
https://tw.news.appledaily.com/forum/realtime/20180802/1403020/
https://tw.news.appledaily.com/life/realtime/20180802/1402115/
https://tw.sports.appledaily.com/realtime/20180802/1403022/
https://tw.sports.appledaily.com/realtime/20180802/1403018/
https://tw.news.appledaily.com/life/realtime/20180802/1403019/
https://tw.finance.appledaily.com/realtime/20180802/1402921/
https://tw.sports.appledaily.com/realtime/20180802/1403014/
https://tw.news.appledaily.com/life/realtime/20180802/1403009/
https://tw.news.appledaily.com/local/realtime/20180802/1403005/
https://tw.finance.appledaily.com/realtime/20180802/1402872/
https://tw.news.appledaily.com/politics/realtime/20180802/1402609/
https://tw.news.appledaily.com/international/realtime/20180802/1403013/
https://tw.news.appledaily.com/local/realtime/20180802/1403012/
https://tw.finance.appledaily.com/realtime/20180802/1402847/
https://tw.news.appledaily.com/local/realtime/20180802/1402990/
https://tw.entertainment.appledaily.com/realtime/20180802/1402795/
https://tw.news.appledaily.com/international/realtime/20180802/1403002/
https://tw.finance.appledaily.com/realtime/20180802/1403011/
https://tw.news.appledaily.com/local/realtime/20180802/1402828/
https://tw.finance.appledaily.com/realtime/20180802/1402836/
https://tw.sports.appledaily.com/realtime/20180802/1403008/
https://tw.news.appledaily.com/international/realtime/20180802/1403006/
https://tw.entertainment.appledaily.com/realtime/20180802/1402569/
https://tw.entertainment.appledaily.com/realtime/20180802/1402873/
https://tw.finance.appledaily.com/realtime/20180802/1402829/
https://tw.finance.appledaily.com/realtime/20180802/1402917/
https://tw.news.appledaily.com/local/realtime/20180802/1402986/

In [22]:
total_page=1
urls = list()
for page in range(1,total_page+1):
    page_url = 'https://tw.appledaily.com/new/realtime/{}'.format(page)
    res = requests.get(page_url)
    soup = BeautifulSoup(res.text,'lxml')
    for i in soup.select('.rtddt a'):
        url = i['href']
        urls.append(url)

In [69]:
article_url = urls[0]

In [275]:
res = requests.get('https://tw.news.appledaily.com/life/realtime/20180802/1403027/')
soup = BeautifulSoup(res.text,'lxml')
contents_obj = soup.find('div',{'class':'ndArticle_margin'})
title = soup.select('h1')[0].text.strip()
viewcount_obj = soup.select('.ndArticle_view')
view_count = viewcount_obj[0].text.strip() if viewcount_obj else 0
dt = soup.select('.ndArticle_creat')[0].text.strip()
content = ''.join([p.text for p in soup.select('article p')]).split('報導）')[0]
keywords = [tag.text.strip() for tag in soup.select('.ndgKeyword a')]

In [276]:
if viewcount_obj:
    view_count = viewcount_obj[0].text.strip() 
else:
    view_count = 0

In [95]:
docs = list()
for article_url in urls:
    try:
        doc =dict()
        res = requests.get(article_url)
        soup = BeautifulSoup(res.text,'lxml')
        title = soup.select('h1')[0].text.strip()
        view_count = soup.select('.ndArticle_view')[0].text.strip()
        dt = soup.select('.ndArticle_creat')[0].text.strip()
        content = ''.join([p.text for p in soup.select('article p')]).split('報導）')[0]
        keywords = [tag.text.strip() for tag in soup.select('.ndgKeyword a')]
        doc['title'] = title
        doc['view_count'] = view_count
        doc['dt'] = dt
        doc['content'] = content
        doc['keywords'] = keywords
        doc['url'] = article_url
        docs.append(doc)
    except Exception as e:
        print('--> url: %s'%(article_url))
        print(e)
        pass

In [66]:
import pandas as pd

In [67]:
df = pd.DataFrame(docs)
df

In [273]:
# docs[0:2]

In [91]:
df

,content,dt,keywords,title,url,view_count
0,更新：現場圖片DB11是Aston Martin這家英國百年老舖進入新世代的轉折點，現在以它...,出版時間：2018/08/02 09:13,[Aston Martin],【做回007 】馬丁最新旗艦DBS德奧搶試 絕妙滋味超難忘,https://tw.lifestyle.appledaily.com/lifestyle/...,1958
1,（更新︰新增照片）買房子跟養孩子，如果只能二選一？甚至，我們都選不起。 台灣去年新生兒出生總...,出版時間：2018/08/02 09:11,"[托育, 育兒, 房價, 公托]",【悲哀】育兒就買不起房 居住正義在哪,https://tw.lifestyle.appledaily.com/lifestyle/...,3709
2,邱澤出道17年，終於在台北電影獎稱帝，星路看似順遂，背後也有想不到的崎嶇，透露曾因為自己準備...,出版時間：2018/08/02 09:08,[邱澤],【邱澤專訪2】自備服裝惹火造型師 高富帥沒衣好穿,https://tw.entertainment.appledaily.com/realti...,8
3,(新增美股收盤、新增台股開盤、台幣開盤)美股周三開高走低，原油行情重挫拖累能源股下跌、美中貿...,出版時間：2018/08/02 09:06,"[美股, 蘋果]",美股收黑台股開11095點跌2點 狹幅震盪,https://tw.finance.appledaily.com/realtime/201...,2853
4,打卡景點都拍過一輪了嗎？不知道哪裡還有漂亮景點？不妨來趟台中軟體園區的藝術廣場，匯集了許多新...,出版時間：2018/08/02 09:05,[],台中又有超可愛打卡景點！讓你手機拍到沒電,https://tw.news.appledaily.com/life/realtime/2...,56
5,施羅德投信與《遠見雜誌》攜手，針對全台灣25至55歲上班族群，製作「上班族退休準備指數」，欲...,出版時間：2018/08/02 09:03,"[年金, 退休金]",6成民眾退休後沒理財 因為「不知管道在哪」,https://tw.finance.appledaily.com/realtime/201...,683
6,(更新：動新聞)新北市某社區一名68歲呂姓管理員前年9月見一名尊稱他「爺爺」的4歲女童在等娃...,出版時間：2018/08/02 09:02,[],4歲女童獨自等娃娃車 竟被「爺爺」逼看Ａ片摸鳥,https://tw.news.appledaily.com/local/realtime/...,5302
7,馬耀．瓦歷斯／文史工作者 自從行政院任命Kolas Yotaka（谷辣斯．尤達卡）為政院...,出版時間：2018/08/02 09:02,[],從「谷辣斯．尤達卡」談原住民族命名制度的演進,https://tw.news.appledaily.com/forum/realtime/...,123
8,網友蠟黃哥問：熬夜看球賽，連續幾天後為何皮膚變得蠟黃，氣色極差？ 開業皮膚科醫師廖苑利答：皮...,出版時間：2018/08/02 09:00,"[熬夜, 皮膚]",【女生要注意】熬夜變蠟黃 原來是錯過時間,https://tw.news.appledaily.com/life/realtime/2...,204
9,今年因傷影響出賽的舊金山巨人隊投手庫艾托(Johnny Cueto)，今天由球團宣布他將接受...,出版時間：2018/08/02 09:00,"[大聯盟, 巨人]",庫艾托將接受TJ手術 本季提前報銷,https://tw.sports.appledaily.com/realtime/2018...,101
10,美國高爾夫協會和英國R&A協會正在研擬，將禁止球員在果嶺上使用「果嶺判讀書」，希望把果嶺判讀...,出版時間：2018/08/02 08:56,[],果嶺判讀書明年遭禁 回歸球員自行判讀能力,https://tw.sports.appledaily.com/realtime/2018...,269
11,中央氣象局在8時30分針對台南與高雄等7縣市發布大雨特報。受西南風影響，易有短時強降雨，今天...,出版時間：2018/08/02 08:56,"[氣象局, 大雨特報]",高雄、台南等7縣市發大雨特報 慎防雷擊、強陣風,https://tw.news.appledaily.com/life/realtime/2...,214
12,晟德(4123)昨日宣佈子公司澳優乳業(港股代號:1717.HK)發佈「盈利喜訊」公告，澳優...,出版時間：2018/08/02 08:52,"[澳優乳業, 晟德, 營收獲利]",澳優乳業上半年獲利成長近8成,https://tw.finance.appledaily.com/realtime/201...,328
13,總獎金325萬美元的英國女子高爾夫公開賽，預計今天下午1點30分開打，台灣包括名將曾雅妮、盧...,出版時間：2018/08/02 08:48,[],英國公開賽今天開打 兩屆冠軍曾雅妮重返幸運地,https://tw.sports.appledaily.com/realtime/2018...,422
14,這段畫面真是想像十足！ 《加藤軍台灣粉絲團 2.0》分享一段畫面，小編註解是「男人退房時就該...,出版時間：2018/08/02 08:47,[],女人退房的走路姿勢 網友「好像懂了什麼」,https://tw.news.appledaily.com/life/realtime/2...,10175
15,當心無恥色狼！《聯合報》報導，桃園簡姓男子誘騙就讀高中的女網友見面，藉口「幫朋友載人」，把女...,出版時間：2018/08/02 08:45,[],惡狼性侵女高中生 被害人開庭顫抖：不想看到他,https://tw.news.appledaily.com/local/realtime/...,2136
16,基頻晶片（baseband）市場洗牌！研調機構Strategy Analytics調查顯示...,出版時間：2018/08/02 08:42,"[晶片, 基頻, 三星, 聯發科, 高通]",基頻晶片洗牌三星超車聯發科 貿易戰恐增變局,https://tw.finance.appledaily.com/realtime/201...,936
17,花蓮地檢署檢察官林俊佑，因為護女心切而到幼兒園公審師生，引發外界撻伐，監委蔡崇義、楊芳婉、楊...,出版時間：2018/08/02 08:36,"[林俊佑, 監察院, 彈劾]",劣檢林俊佑送監察院 最重可被彈劾,https://tw.news.appledaily.com/politics/realti...,883
18,英國威爾斯卡迪夫中央車站(Cardiff Central Station)近日被民眾拍到一段...,出版時間：2018/08/02 08:35,"[火車, 野戰, 41J]",火車最美風景 赤裸男女激情抬腿野戰,https://tw.news.appledaily.com/international/r...,5735
19,更新：新增照片嘉義縣朴子市發生住宅搶案，83歲涂姓阿嬤獨自在家，遭1名年約50歲矮小個子的歹...,出版時間：2018/08/02 09:18,"[搶匪, 持水果刀, 不給錢就刺你, 沒錢吃飯]",「不給錢就刺妳」 搶匪持刀劫嬤3千元,https://tw.news.appledaily.com/local/realtime/...,517
20,自Facebook正式宣佈Facebook Gaming計劃後，為了培育新一代的直播新星，卡...,出版時間：2018/08/02 08:31,[臉書],臉書遊戲創作者招募 尋找遊戲之星,https://tw.finance.appledaily.com/realtime/201...,324
21,（更新：新增偵辦進度）由男子李進來成立的應召集團，自中國引進女子來台賣淫，並在大台北地區租了...,出版時間：2018/08/02 08:25,[],疑受色情業者性招待 專勤隊分隊長10萬交保,https://tw.news.appledaily.com/local/realtime/...,18598
22,運動品牌PUMA今夏新款女鞋又一發，這次以美西的加州陽光為題，推出PUMA Caiforni...,出版時間：2018/08/02 08:25,"[PUMA, Selena Gomez, 賽琳娜]",PUMA新女鞋今開賣 賽琳娜開中門身援,https://tw.entertainment.appledaily.com/realti...,1334
23,西好萊塢（West Hollywood）一家同志酒吧老闆庫利（David Cooley），日...,出版時間：2018/08/02 08:22,"[性別歧視, 性別平權, 阿拉斯加航空, LGBTQ, 第一修正]",要求同志情侶讓位 阿拉斯加航空道歉,https://tw.news.appledaily.com/international/r...,1251
24,美國貿易戰擔憂重燃，4大指數除NASDAQ小漲外，其餘指數全數收低。蘋果財報優於預期，昨天...,出版時間：2018/08/02 08:21,"[大慶證券, 台股, 貿易戰, 蘋果]",美中貿易紛爭再起 但蘋概股成盤面主流,https://tw.finance.appledaily.com/realtime/201...,456
25,（更新：新增動新聞）新北市一名胡姓男子今年6月深夜持菜刀到板橋區一家超商行搶，店員卻淡定說「...,出版時間：2018/08/02 08:20,[],超商遇搶 佛系店員1句話讓匪當場傻了,https://tw.news.appledaily.com/local/realtime/...,87668
26,鮮活果汁-KY（1256）公告第2季財報，單季稅後純益1.57億元，每股純益5.08元，創下...,出版時間：2018/08/02 08:20,"[鮮活果汁, 手搖茶, 飲料]",歷史新高 鮮活果汁-KY單季賺半個股本,https://tw.finance.appledaily.com/realtime/201...,1009

### [pandas intro]

In [192]:
df_ = pd.DataFrame([['frank', 'M', 29], ['mary', 'F', 23], ['tom', 'M', 35], ['ted', 'M', 33], ['jean', 'F', 21], ['lisa', 'F', 20]])

In [101]:
pd.DataFrame({'name':['frank','mary','tom'],'gender':['M','F','M']})

  gender   name
0      M  frank
1      F   mary
2      M    tom

In [104]:
df_

       0  1   2
0  frank  M  29
1   mary  F  23
2    tom  M  35
3    ted  M  33
4   jean  F  21
5   lisa  F  20

In [194]:
df_.columns = ['name','gender','age']

In [107]:
df_.columns

Index(['name', 'gender', 'age'], dtype='object')

In [110]:
# df_ = df_.set_index('name')
# df_

      gender  age
name
frank      M   29
mary       F   23
tom        M   35
ted        M   33
jean       F   21
lisa       F   20

In [115]:
df_.head(3)

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35

In [116]:
df_.tail(3)

   name gender  age
3   ted      M   33
4  jean      F   21
5  lisa      F   20

In [117]:
df_.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
name      6 non-null object
gender    6 non-null object
age       6 non-null int64
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [119]:
df_.describe()

             age
count   6.000000
mean   26.833333
std     6.400521
min    20.000000
25%    21.500000
50%    26.000000
75%    32.000000
max    35.000000

In [ ]:
#ix,loc,iloc

In [120]:
df_.ix[0,0]

/Users/YorkLin/.pyenv/versions/3.6.0/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

'frank'

In [122]:
df_.ix[[0,1],[0,1]]

    name gender
0  frank      M
1   mary      F

In [123]:
df_.ix[0:3,0:2]

    name gender
0  frank      M
1   mary      F
2    tom      M
3    ted      M

In [130]:
df_.ix[0:2,:]

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35

In [132]:
df_.ix[:,0:2]

    name gender
0  frank      M
1   mary      F
2    tom      M
3    ted      M
4   jean      F
5   lisa      F

In [133]:
##loc -> labeled name
df_.loc[0:3,'name']

0    frank
1     mary
2      tom
3      ted
Name: name, dtype: object

In [135]:
df_.loc[0:5,['name','age']]

    name  age
0  frank   29
1   mary   23
2    tom   35
3    ted   33
4   jean   21
5   lisa   20

In [137]:
#iloc -> index location
df_.iloc[0:5,0:2]

    name gender
0  frank      M
1   mary      F
2    tom      M
3    ted      M
4   jean      F

In [147]:
df_[df_.gender == 'M']

    name gender  age
0  frank      M   29
2    tom      M   35
3    ted      M   33

In [146]:
df_[df_['gender'] == 'M']

    name gender  age
0  frank      M   29
2    tom      M   35
3    ted      M   33

In [151]:
df_[(df_['gender'] == 'M') & (df_['age'] > 30)]

  name gender  age
2  tom      M   35
3  ted      M   33

In [152]:
df_[(df_['gender'] == 'M') | (df_['age'] > 30)]

    name gender  age
0  frank      M   29
2    tom      M   35
3    ted      M   33

In [171]:
# add new rows/ columns
df_['is_employee'] = True

In [196]:
from datetime import datetime
df_['now_year'] = datetime.now().year

In [175]:
[True]*3+[False]*3

[True, True, True, False, False, False]

In [177]:
df_['is_employee'] = [True]*3+[False]*3

In [195]:
df_['is_employee'] = pd.Series([True]*3+[False]*3)

In [181]:
pd.Series([True]*3+[False]*3)

0     True
1     True
2     True
3    False
4    False
5    False
dtype: bool

In [198]:
df_.loc[6] = ['sharen','F',21,True,2018]

In [203]:
# delete rows/columns
df_ = df_.drop(6,axis=0)

In [215]:
df_ = df_.drop(['now_year','is_employee'],axis=1)

In [207]:
df2 = pd.DataFrame([['york','M','29']],columns=['name','gender','age'])

In [210]:
# concat two dataframes
df3 = pd.concat([df_,df2])

In [218]:
df2 = pd.DataFrame({'employee':[True]*6,'is_married':[True]*6})
df2

   employee  is_married
0      True        True
1      True        True
2      True        True
3      True        True
4      True        True
5      True        True

In [222]:
df3 = pd.concat([df_,df2],axis=1)
df3

    name gender  age  employee  is_married
0  frank      M   29      True        True
1   mary      F   23      True        True
2    tom      M   35      True        True
3    ted      M   33      True        True
4   jean      F   21      True        True
5   lisa      F   20      True        True

In [224]:
tmp = pd.DataFrame([['york','M','29']],columns=['name','gender','age'])
tmp

   name gender age
0  york      M  29

In [257]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6 entries, 0 to 5
Data columns (total 5 columns):
name          6 non-null object
gender        6 non-null object
age           6 non-null int64
employee      6 non-null bool
is_married    6 non-null bool
dtypes: bool(2), int64(1), object(2)
memory usage: 204.0+ bytes

In [258]:
tmp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1 entries, 0 to 0
Data columns (total 3 columns):
name      1 non-null object
gender    1 non-null object
age       1 non-null object
dtypes: object(3)
memory usage: 104.0+ bytes

In [232]:
#concat dfs and reset_index
df_final = pd.concat([df3,tmp],axis=0)
df_final = df_final.reset_index(drop=True)
df_final

  age employee gender is_married   name
0  29     True      M       True  frank
1  23     True      F       True   mary
2  35     True      M       True    tom
3  33     True      M       True    ted
4  21     True      F       True   jean
5  20     True      F       True   lisa
6  29      NaN      M        NaN   york

In [233]:
# drop missing data
df_final.dropna()

  age employee gender is_married   name
0  29     True      M       True  frank
1  23     True      F       True   mary
2  35     True      M       True    tom
3  33     True      M       True    ted
4  21     True      F       True   jean
5  20     True      F       True   lisa

In [239]:
# use is_null() to filter data
df_final[-df_final.is_married.isnull()]

  age employee gender is_married   name
0  29     True      M       True  frank
1  23     True      F       True   mary
2  35     True      M       True    tom
3  33     True      M       True    ted
4  21     True      F       True   jean
5  20     True      F       True   lisa

In [240]:
df_final[-df_final.name.isnull()]

  age employee gender is_married   name
0  29     True      M       True  frank
1  23     True      F       True   mary
2  35     True      M       True    tom
3  33     True      M       True    ted
4  21     True      F       True   jean
5  20     True      F       True   lisa
6  29      NaN      M        NaN   york

In [244]:
#fill missing data
df_final.is_married =df_final.is_married.fillna(True)

In [245]:
df_final

  age employee gender  is_married   name
0  29     True      M        True  frank
1  23     True      F        True   mary
2  35     True      M        True    tom
3  33     True      M        True    ted
4  21     True      F        True   jean
5  20     True      F        True   lisa
6  29      NaN      M        True   york

In [248]:
df_final = df_final.dropna()

In [252]:
#groupby and aggregation
df_final.groupby('gender').age.count()

gender
F    3
M    3
Name: age, dtype: int64

In [253]:
df_final.groupby('gender').age.mean()

DataError: No numeric types to aggregate

In [261]:
df_final.age = df_final.age.astype('int64')

/Users/YorkLin/.pyenv/versions/3.6.0/lib/python3.6/site-packages/pandas/core/generic.py:3110: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self[name] = value

In [263]:
df_final.loc[:,'age'] = df_final.age.astype('int64')

/Users/YorkLin/.pyenv/versions/3.6.0/lib/python3.6/site-packages/pandas/core/indexing.py:517: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self.obj[item] = s

In [269]:
df_final.groupby('gender').age.mean()

gender
F    21.333333
M    32.333333
Name: age, dtype: float64

In [271]:
#sort by column
df_final.sort_values('age')

   age employee gender  is_married   name
5   20     True      F        True   lisa
4   21     True      F        True   jean
1   23     True      F        True   mary
0   29     True      M        True  frank
3   33     True      M        True    ted
2   35     True      M        True    tom

In [272]:
df_final.sort_values('age',ascending=False)

   age employee gender  is_married   name
2   35     True      M        True    tom
3   33     True      M        True    ted
0   29     True      M        True  frank
1   23     True      F        True   mary
4   21     True      F        True   jean
5   20     True      F        True   lisa

### [ use pandas to clean appledaily data ]

In [340]:
df['tm'] = df.dt.str.replace('出版時間：','').apply(lambda x: int(datetime.strptime(x,'%Y/%m/%d %H:%M').timestamp() ) )

In [343]:
def str_to_timestamp(row):
    return int(datetime.strptime(row,'%Y/%m/%d %H:%M').timestamp())

In [345]:
df.dt.str.replace('出版時間：','').apply(str_to_timestamp)

0     1533172380
1     1533172260
2     1533172080
3     1533171960
4     1533171900
5     1533171780
6     1533171720
7     1533171720
8     1533171600
9     1533171600
10    1533171360
11    1533171360
12    1533171120
13    1533170880
14    1533170820
15    1533170700
16    1533170520
17    1533170160
18    1533170100
19    1533172680
20    1533169860
21    1533169500
22    1533169500
23    1533169320
24    1533169260
25    1533169200
26    1533169200
Name: dt, dtype: int64

In [374]:
df[['author','location']] =df.content.str.extract('（(\w+)[/／](\w+)')

/Users/YorkLin/.pyenv/versions/3.6.0/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: currently extract(expand=None) means expand=False (return Index/Series/DataFrame) but in a future version of pandas this will be changed to expand=True (return DataFrame)
  """Entry point for launching an IPython kernel.

In [388]:
df.content = df.content.str.replace('（(\w+)[/／](\w+)','')

In [391]:
df = df.drop('dt',axis=1)

In [395]:
df.to_csv('../appledaily_articles.csv')

In [372]:
### use re extract
import re
re.search('（(\w+)[/／](\w+)',df.content[2]).groups()

('張力文', '台北')

In [366]:
re.search('（(\w+)／(\w+)',df.content[1]).groups()

('黃韻文', '台北')

### [crawler example: 591 - requests.get with params]

In [459]:
url ='https://rent.591.com.tw/home/search/rsList?is_new_list=1&type=1&kind=0&searchtype=1&region=3&firstRow=30&totalRows=8193'

In [461]:
params_str = url.split('?')[1]

In [462]:
params = dict()
for i in params_str.split('&'):
    tmp = i.split('=')
    params[tmp[0]] = tmp[1]
params

{'firstRow': '30',
 'is_new_list': '1',
 'kind': '0',
 'region': '3',
 'searchtype': '1',
 'totalRows': '8193',
 'type': '1'}

In [463]:
url = 'https://rent.591.com.tw/home/search/rsList?is_new_list=1&type=1&kind=0&searchtype=1&region=3&firstRow=60&totalRows=8192'

In [464]:
params_str = url.split('?')[1]

In [465]:
params = dict()
for i in params_str.split('&'):
    tmp = i.split('=')
    params[tmp[0]] = tmp[1]
params

{'firstRow': '60',
 'is_new_list': '1',
 'kind': '0',
 'region': '3',
 'searchtype': '1',
 'totalRows': '8192',
 'type': '1'}

In [426]:
headers = {
   'Cookie': 'webp=1; PHPSESSID=cil0d8i31q4ou4vvgnm65p71q7; is_new_index=1; is_new_index_redirect=1; T591_TOKEN=cil0d8i31q4ou4vvgnm65p71q7; _ga=GA1.3.1460103694.1532579932; _ga=GA1.4.1460103694.1532579932; _gid=GA1.3.115974707.1533187563; c10f3143a018a0513ebe1e8d27b5391c=1; _gid=GA1.4.115974707.1533187563; new_rent_list_kind_test=0; loginNoticeStatus=1; loginNoticeNumber=1; cto_lwid=2c8f8a53-f9fd-49c0-91b4-348e770ef1fb; __asc=53468424164f923057bd97cd402; __auc=53468424164f923057bd97cd402; urlJumpIp=3; urlJumpIpByTxt=%E6%96%B0%E5%8C%97%E5%B8%82; ba_cid=a%3A5%3A%7Bs%3A6%3A%22ba_cid%22%3Bs%3A32%3A%22f027cfb18205aba5d0cf210b3feb5fbb%22%3Bs%3A7%3A%22page_ex%22%3Bs%3A110%3A%22https%3A%2F%2Fnewhouse.591.com.tw%2Findex.php%3FfirstRow%3D20%26totalRows%3D81%26rid%3D3%26sid%3D46%26sids%3D46%26module%3Dhousing%26action%3Dlist%22%3Bs%3A4%3A%22page%22%3Bs%3A55%3A%22https%3A%2F%2Fnewhouse.591.com.tw%2Fhousing-list.html%3F%26keyword%3D%22%3Bs%3A7%3A%22time_ex%22%3Bi%3A1533189196%3Bs%3A4%3A%22time%22%3Bi%3A1533189385%3B%7D; last_search_type=1; index_keyword_search_analysis=%7B%22role%22%3A%222%22%2C%22type%22%3A1%2C%22keyword%22%3A%22%22%2C%22selectKeyword%22%3A%22%22%2C%22menu%22%3A%22%22%2C%22hasHistory%22%3A0%2C%22hasPrompt%22%3A0%2C%22history%22%3A0%7D; _gat_UA-97423186-1=1; DETAIL[1][6638702]=1; house9d948b9639bc3c7336ce0398fe0eda87=1; user_index_role=1; user_browse_recent=a%3A2%3A%7Bi%3A0%3Ba%3A2%3A%7Bs%3A4%3A%22type%22%3Bi%3A1%3Bs%3A7%3A%22post_id%22%3Bs%3A7%3A%226638702%22%3B%7Di%3A1%3Ba%3A2%3A%7Bs%3A4%3A%22type%22%3Bi%3A8%3Bs%3A7%3A%22post_id%22%3Bi%3A111859%3B%7D%7D; 591_new_session=eyJpdiI6ImJrYXREZzhkTUdcL1wvU0hUM01oc1dBdz09IiwidmFsdWUiOiJ5SzY1VWkzNEdBZGVYVitoVzVyTE5GbzRzZVp0SjRVTkJMeFRQdW5sMHJXV3ROK1JQcU5jV2N4dGsxM0xSdXBIaG11OE96ZzZ1SlRCR0drS3FhXC9VZVE9PSIsIm1hYyI6IjZkOTM4Mjg5NjYwZmVkYWJhYWRlZWZlYmE4MDdkZmVlYTE3MWUyNjIwNmUwN2FmY2E0ODg1YjdjMmFhMmY0YzEifQ%3D%3D',
   'User-Agent':'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_13_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/67.0.3396.99 Safari/537.36'
}

In [427]:
url.split('?')[0]

'https://rent.591.com.tw/home/search/rsList'

In [428]:
res = requests.get('https://rent.591.com.tw/home/search/rsList',params=params,headers=headers)

In [435]:
pd.DataFrame(res.json()['data']['data'])

,addInfo,addition2,addition3,addition4,addr_number_name,address,address_img,address_img_title,alley_name,allfloor,...,storeprice,street_name,streetid,type,unit,updatetime,user_id,vipBorder,vipimg,vipstyle
0,,0,0,1,,圓通路299巷精美兩房遠景..,精美兩房遠景整層出租,精美兩房遠景整層出租,299巷,13,...,0,圓通路,26944,1,元/月,1533015122,530490,vipStyle,,isvip
1,,0,0,1,252號,自強路一段優質飲食商圈/4..,優質飲食商圈/4樓套房/附精緻家具,優質飲食商圈/4樓套房/附精緻家具,,4,...,0,自強路一段,26595,1,元/月,1533112265,141485,vipStyle,,isvip
2,,0,0,1,26號,景平路64巷全新整理4房2..,全新整理4房2廳1衛低公設大空間,全新整理4房2廳1衛低公設大空間,64巷,4,...,0,景平路,26936,1,元/月,1533166322,1537248,vipStyle,,isvip
3,,0,0,1,,新台五路一段全新豪..,全新豪華頂級雅房,全新豪華頂級雅房,,5,...,0,新台五路一段,27350,1,元/月,1530762644,1565460,vipStyle,,isvip
4,,0,0,1,24號,溪崑二街56巷近樹林車站獨..,近樹林車站獨立洗衣專人倒垃圾套房,近樹林車站獨立洗衣專人倒垃圾套房,56巷,5,...,0,溪崑二街,27627,1,元/月,1533188497,1746442,vipStyle,,isvip
5,,0,0,1,202號,昌平街昌平國小旁車位優惠..,昌平國小旁車位優惠出租中！,昌平國小旁車位優惠出租中！,,0,...,0,昌平街,28352,1,元/月,1528094848,148501,vipStyle,,isvip
6,,0,0,1,188號,民德路民德立體停車場車位..,民德立體停車場車位出租,民德立體停車場車位出租,,0,...,0,民德路,26887,1,元/月,1528094883,148501,vipStyle,,isvip
7,,0,0,1,,貴子路輔大醫院地下停車場..,輔大醫院地下停車場車位出租,輔大醫院地下停車場車位出租,,0,...,0,貴子路,65386,1,元/月,1528094944,148501,vipStyle,,isvip
8,,0,0,1,2號,頂文路三重光復平面停車場..,三重光復平面停車場車位優惠出租,三重光復平面停車場車位優惠出租,,0,...,0,頂文路,69395,1,元/月,1528097046,148501,vipStyle,,isvip
9,,0,0,1,118號,安康路二段【精選】1樓四..,【精選】1樓四房49坪、前後76坪大庭院,【精選】1樓四房49坪、前後76坪大庭院,,14,...,0,安康路二段,28133,1,元/月,1531369122,228993,vipStyle,,isvip
10,,0,0,1,,中正路598巷遠東世..,遠東世紀ABC旁時尚獨立小套房,遠東世紀ABC旁時尚獨立小套房,598巷,5,...,0,中正路,26872,1,元/月,1533111584,1323133,vipStyle,,isvip
11,,0,0,1,7號,民權路【精選1樓】秀朗國..,【精選1樓】秀朗國小、愛買商圈套房,【精選1樓】秀朗國小、愛買商圈套房,,5,...,0,民權路,27075,1,元/月,1533101391,228993,vipStyle,,isvip
12,,0,0,1,,新市一路三段大四房中高樓..,大四房中高樓層寬敞亮麗室內約45坪,大四房中高樓層寬敞亮麗室內約45坪,,15,...,0,新市一路三段,64169,1,元/月,1530887290,163169,vipStyle,,isvip
13,,0,0,1,,保健路76巷*獨立套..,*獨立套房*近四號公園永安捷運,*獨立套房*近四號公園永安捷運,76巷,5,...,0,保健路,26916,1,元/月,1531718941,1346413,vipStyle,,isvip
14,,0,0,1,171號,宜安路【可短租】全..,【可短租】全新大樓陽台套房、永安捷運旁,【可短租】全新大樓陽台套房、永安捷運旁,,12,...,0,宜安路,26908,1,元/月,1531799971,1388683,vipStyle,,isvip
15,,0,0,1,118號,安康路二段【已收訂..,【已收訂】實惠社區3房、保全、電梯,【已收訂】實惠社區3房、保全、電梯,,14,...,0,安康路二段,28133,1,元/月,1532407085,228993,vipStyle,,isvip
16,,0,0,1,253號,環河南路忠孝橋中興橋一房..,忠孝橋中興橋一房一廳5分鐘到達台北市中心,忠孝橋中興橋一房一廳5分鐘到達台北市中心,,5,...,0,環河南路,26675,1,元/月,1532915407,1718699,vipStyle,,isvip
17,,0,0,1,,集美街捷運三重站步行9分..,"捷運三重站步行9分鐘,舒適兩房","捷運三重站步行9分鐘,舒適兩房",,5,...,0,集美街,26650,1,元/月,1532388363,1624940,vipStyle,,isvip
18,,0,0,1,,中正路淡水捷運站旁..,淡水捷運站旁老街精緻套房（超便宜、限女性,淡水捷運站旁老街精緻套房（超便宜、限女性,,3,...,0,中正路,27908,1,元/月,1532680099,194390,vipStyle,,isvip
19,,0,0,1,,三民街8巷淡水老街景觀平..,淡水老街景觀平價雅房(超便宜丶限女性）,淡水老街景觀平價雅房(超便宜丶限女性）,8巷,5,...,0,三民街,27878,1,元/月,1532680144,194390,vipStyle,,isvip
20,,0,0,1,,松江街72巷江子翠捷運站5..,江子翠捷運站5分鐘幫收垃圾服務學區,江子翠捷運站5分鐘幫收垃圾服務學區,72巷,5,...,0,松江街,27577,1,元/月,1533182652,217187,vipStyle,,isvip
21,,0,0,1,,文化路一段新巨蛋稀有邊間..,新巨蛋稀有邊間套房~有陽台,新巨蛋稀有邊間套房~有陽台,,40,...,0,文化路一段,27519,1,元/月,1533112126,1428511,vipStyle,,isvip
22,,0,0,1,,介壽街近新埔捷運站2號出..,近新埔捷運站2號出口(走路3到5分鐘),近新埔捷運站2號出口(走路3到5分鐘),,5,...,0,介壽街,27515,1,元/月,1533122890,1619135,vipStyle,,isvip
23,,0,0,1,83號,民生路【精選2F】大..,【精選2F】大窗戶、通風、明亮、雙人床,【精選2F】大窗戶、通風、明亮、雙人床,,5,...,0,民生路,27068,1,元/月,1533101455,228993,vipStyle,,isvip
24,,0,0,1,,縣民大道一段96巷全新府中..,全新府中站旅行風設計感兩房一廳,全新府中站旅行風設計感兩房一廳,96巷,5,...,0,縣民大道一段,27651,1,元/月,1532614624,1997528,vipStyle,,isvip
25,,0,0,1,,北新路三段全新豪宅高級精..,全新豪宅高級精品傢俱生活機能特佳,全新豪宅高級精品傢俱生活機能特佳,,23,...,0,北新路三段,28095,1,元/月,1532876227,602200,vipStyle,,isvip
26,,0,0,1,82號,萬安街近捷運商圈獨立套房..,近捷運商圈獨立套房一卡皮箱即可入住,近捷運商圈獨立套房一卡皮箱即可入住,,5,...,0,萬安街,28392,1,元/月,1532747223,1299375,vipStyle,,isvip
27,,0,0,1,,清水街淡水捷運站旁老街精..,淡水捷運站旁老街精緻雅房（超便宜丶限女性,淡水捷運站旁老街精緻雅房（超便宜丶限女性,,6,...,0,清水街,27990,1,元/月,1532679934,194390,vipStyle,,isvip
28,,0,0,1,,福和路永福橋一樓全..,永福橋一樓全新裝潢時尚精品小套房,永福橋一樓全新裝潢時尚精品小套房,,5,...,0,福和路,27115,1,元/月,1530843482,1323133,vipStyle,,isvip
29,,0,0,1,,備內街158巷備內街漂亮套..,備內街漂亮套房家具家電全馬上可入住,備內街漂亮套房家具家電全馬上可入住,158巷,2,...,0,備內街,28689,1,元/月,1532344814,1313951,vipStyle,,isvip

In [453]:
url = 'https://rent.591.com.tw/home/search/rsList'
page_per_count = 30
df = pd.DataFrame([])
params = {'firstRow': '0',
 'is_new_list': '1',
 'kind': '0',
 'region': '3',
 'searchtype': '1',
 'totalRows': '8193',
 'type': '1'}
headers = {
   'Cookie': 'webp=1; PHPSESSID=cil0d8i31q4ou4vvgnm65p71q7; is_new_index=1; is_new_index_redirect=1; T591_TOKEN=cil0d8i31q4ou4vvgnm65p71q7; _ga=GA1.3.1460103694.1532579932; _ga=GA1.4.1460103694.1532579932; _gid=GA1.3.115974707.1533187563; c10f3143a018a0513ebe1e8d27b5391c=1; _gid=GA1.4.115974707.1533187563; new_rent_list_kind_test=0; loginNoticeStatus=1; loginNoticeNumber=1; cto_lwid=2c8f8a53-f9fd-49c0-91b4-348e770ef1fb; __asc=53468424164f923057bd97cd402; __auc=53468424164f923057bd97cd402; urlJumpIp=3; urlJumpIpByTxt=%E6%96%B0%E5%8C%97%E5%B8%82; ba_cid=a%3A5%3A%7Bs%3A6%3A%22ba_cid%22%3Bs%3A32%3A%22f027cfb18205aba5d0cf210b3feb5fbb%22%3Bs%3A7%3A%22page_ex%22%3Bs%3A110%3A%22https%3A%2F%2Fnewhouse.591.com.tw%2Findex.php%3FfirstRow%3D20%26totalRows%3D81%26rid%3D3%26sid%3D46%26sids%3D46%26module%3Dhousing%26action%3Dlist%22%3Bs%3A4%3A%22page%22%3Bs%3A55%3A%22https%3A%2F%2Fnewhouse.591.com.tw%2Fhousing-list.html%3F%26keyword%3D%22%3Bs%3A7%3A%22time_ex%22%3Bi%3A1533189196%3Bs%3A4%3A%22time%22%3Bi%3A1533189385%3B%7D; last_search_type=1; index_keyword_search_analysis=%7B%22role%22%3A%222%22%2C%22type%22%3A1%2C%22keyword%22%3A%22%22%2C%22selectKeyword%22%3A%22%22%2C%22menu%22%3A%22%22%2C%22hasHistory%22%3A0%2C%22hasPrompt%22%3A0%2C%22history%22%3A0%7D; _gat_UA-97423186-1=1; DETAIL[1][6638702]=1; house9d948b9639bc3c7336ce0398fe0eda87=1; user_index_role=1; user_browse_recent=a%3A2%3A%7Bi%3A0%3Ba%3A2%3A%7Bs%3A4%3A%22type%22%3Bi%3A1%3Bs%3A7%3A%22post_id%22%3Bs%3A7%3A%226638702%22%3B%7Di%3A1%3Ba%3A2%3A%7Bs%3A4%3A%22type%22%3Bi%3A8%3Bs%3A7%3A%22post_id%22%3Bi%3A111859%3B%7D%7D; 591_new_session=eyJpdiI6ImJrYXREZzhkTUdcL1wvU0hUM01oc1dBdz09IiwidmFsdWUiOiJ5SzY1VWkzNEdBZGVYVitoVzVyTE5GbzRzZVp0SjRVTkJMeFRQdW5sMHJXV3ROK1JQcU5jV2N4dGsxM0xSdXBIaG11OE96ZzZ1SlRCR0drS3FhXC9VZVE9PSIsIm1hYyI6IjZkOTM4Mjg5NjYwZmVkYWJhYWRlZWZlYmE4MDdkZmVlYTE3MWUyNjIwNmUwN2FmY2E0ODg1YjdjMmFhMmY0YzEifQ%3D%3D',
   'User-Agent':'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_13_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/67.0.3396.99 Safari/537.36'
}
for page in range(1,3+1):
    params['firstRow'] = 0 + page_per_count * (page -1)
    res = requests.get(url,params=params,headers=headers)
    df_ = pd.DataFrame(res.json()['data']['data'])
    df = pd.concat([df,df_])

In [456]:
df.reset_index(drop=True).to_csv('../591_examples.csv')